wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/uspi_reg.h
/**************************************************************************//**
 * @file     uspi_reg.h
 * @version  V1.00
 * @brief    USPI register definition header file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#ifndef __USPI_REG_H__
#define __USPI_REG_H__

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/** @addtogroup REGISTER Control Register

  @{

*/


/*---------------------- SPI Mode of USCI Controller -------------------------*/
/**
    @addtogroup USPI SPI Mode of USCI Controller (USPI)
    Memory Mapped Structure for USPI Controller
@{ */
 
typedef struct
{


/**
 * @var USPI_T::CTL
 * Offset: 0x00  USCI Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |FUNMODE   |Function Mode
 * |        |          |This bit field selects the protocol for this USCI controller
 * |        |          |Selecting a protocol that is not available or a reserved combination disables the USCI
 * |        |          |When switching between two protocols, the USCI has to be disabled before selecting a new protocol
 * |        |          |Simultaneously, the USCI will be reset when user write 000 to FUNMODE.
 * |        |          |000 = The USCI is disabled. All protocol related state machines are set to idle state.
 * |        |          |001 = The SPI protocol is selected.
 * |        |          |010 = The UART protocol is selected.
 * |        |          |100 = The I2C protocol is selected.
 * |        |          |Note: Other bit combinations are reserved.
 * @var USPI_T::INTEN
 * Offset: 0x04  USCI Interrupt Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1]     |TXSTIEN   |Transmit Start Interrupt Enable Bit
 * |        |          |This bit enables the interrupt generation in case of a transmit start event.
 * |        |          |0 = The transmit start interrupt Disabled.
 * |        |          |1 = The transmit start interrupt Enabled.
 * |        |          |Note: The transmit start event happens when hardware starts to move TX data from data buffer to shift data unit.
 * |[2]     |TXENDIEN  |Transmit End Interrupt Enable Bit
 * |        |          |This bit enables the interrupt generation in case of a transmit finish event.
 * |        |          |0 = The transmit finish interrupt Disabled.
 * |        |          |1 = The transmit finish interrupt Enabled.
 * |        |          |Note: The transmit finish event happens when hardware sends the last bit of TX data from shift data unit.
 * |[3]     |RXSTIEN   |Receive Start Interrupt Enable Bit
 * |        |          |This bit enables the interrupt generation in case of a receive start event.
 * |        |          |0 = The receive start interrupt Disabled.
 * |        |          |1 = The receive start interrupt Enabled.
 * |        |          |Note: For SPI master mode, the receive start event happens when SPI master sends slave select active and spi clock to the external SPI slave
 * |        |          |For SPI slave mode, the receive start event happens when slave select of SPI slave is active and spi clock of SPI slave is inputed from the external SPI master.
 * |[4]     |RXENDIEN  |Receive End Interrupt Enable Bit
 * |        |          |This bit enables the interrupt generation in case of a receive finish event.
 * |        |          |0 = The receive end interrupt Disabled.
 * |        |          |1 = The receive end interrupt Enabled.
 * |        |          |Note: The receive finish event happens when hardware receives the last bit of RX data into shift data unit.
 * @var USPI_T::BRGEN
 * Offset: 0x08  USCI Baud Rate Generator Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |RCLKSEL   |Reference Clock Source Selection
 * |        |          |This bit selects the source of reference clock (fREF_CLK).
 * |        |          |0 = Peripheral device clock fPCLK.
 * |        |          |1 = Reserved.
 * |[1]     |PTCLKSEL  |Protocol Clock Source Selection
 * |        |          |This bit selects the source of protocol clock (fPROT_CLK).
 * |        |          |0 = Reference clock fREF_CLK.
 * |        |          |1 = fREF_CLK2 (its frequency is half of fREF_CLK).
 * |[3:2]   |SPCLKSEL  |Sample Clock Source Selection
 * |        |          |This bit field used for the clock source selection of sample clock (fSAMP_CLK) for the protocol processor.
 * |        |          |00 = fDIV_CLK.
 * |        |          |01 = fPROT_CLK.
 * |        |          |10 = fSCLK.
 * |        |          |11 = fREF_CLK.
 * |[4]     |TMCNTEN   |Time Measurement Counter Enable Bit
 * |        |          |This bit enables the 10-bit timing measurement counter.
 * |        |          |0 = Time measurement counter Disabled.
 * |        |          |1 = Time measurement counter Enabled.
 * |[5]     |TMCNTSRC  |Time Measurement Counter Clock Source Selection
 * |        |          |0 = Time measurement counter with fPROT_CLK.
 * |        |          |1 = Time measurement counter with fDIV_CLK.
 * |[25:16] |CLKDIV    |Clock Divider
 * |        |          |This bit field defines the ratio between the protocol clock frequency fPROT_CLK and the clock divider frequency fDIV_CLK (fDIV_CLK = fPROT_CLK / (CLKDIV+1) ).
 * @var USPI_T::DATIN0
 * Offset: 0x10  USCI Input Data Signal Configuration Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SYNCSEL   |Input Signal Synchronization Selection
 * |        |          |This bit selects if the un-synchronized input signal (with optionally inverted) or the synchronized (and optionally filtered) signal, which is synchronized with PCLK, can be used as input for the data shift unit.
 * |        |          |0 = The un-synchronized signal can be taken as input for the data shift unit.
 * |        |          |1 = The synchronized signal can be taken as input for the data shift unit.
 * |        |          |Note: In SPI protocol, it is suggested this bit should be set as 0.
 * |[2]     |ININV     |Input Signal Inverse Selection
 * |        |          |This bit defines the inverter enable of the input asynchronous signal.
 * |        |          |0 = The un-synchronized input signal will not be inverted.
 * |        |          |1 = The un-synchronized input signal will be inverted.
 * |        |          |Note: In SPI protocol, it is suggested this bit should be set as 0.
 * @var USPI_T::CTLIN0
 * Offset: 0x20  USCI Input Control Signal Configuration Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SYNCSEL   |Input Synchronization Signal Selection
 * |        |          |This bit selects if the un-synchronized input signal (with optionally inverted) or the synchronized (and optionally filtered) signal, which is synchronized with PCLK, can be used as input for the data shift unit.
 * |        |          |0 = The un-synchronized signal can be taken as input for the data shift unit.
 * |        |          |1 = The synchronized signal can be taken as input for the data shift unit.
 * |        |          |Note: In SPI protocol, it is suggested this bit should be set as 0.
 * |[2]     |ININV     |Input Signal Inverse Selection
 * |        |          |This bit defines the inverter enable of the input asynchronous signal.
 * |        |          |0 = The un-synchronized input signal will not be inverted.
 * |        |          |1 = The un-synchronized input signal will be inverted.
 * @var USPI_T::CLKIN
 * Offset: 0x28  USCI Input Clock Signal Configuration Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SYNCSEL   |Input Synchronization Signal Selection
 * |        |          |This bit selects if the un-synchronized input signal or the synchronized (and optionally filtered) signal, which is synchronized with PCLK, can be used as input for the data shift unit.
 * |        |          |0 = The un-synchronized signal can be taken as input for the data shift unit.
 * |        |          |1 = The synchronized signal can be taken as input for the data shift unit.
 * |        |          |Note: In SPI protocol, it is suggested this bit should be set as 0.
 * @var USPI_T::LINECTL
 * Offset: 0x2C  USCI Line Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |LSB       |LSB First Transmission Selection
 * |        |          |0 = The MSB, which bit of transmit/receive data buffer depends on the setting of DWIDTH, is transmitted/received first.
 * |        |          |1 = The LSB, the bit 0 of data buffer, will be transmitted/received first.
 * |[5]     |DATOINV   |Data Output Inverse Selection
 * |        |          |This bit defines the relation between the internal shift data value and the output data signal of USCIx_DAT0/1 pins.
 * |        |          |0 = Data output values of USCIx_DAT0/1 pins are not inverted.
 * |        |          |1 = Data output values of USCIx_DAT0/1 pins are inverted.
 * |[7]     |CTLOINV   |Control Signal Output Inverse Selection
 * |        |          |This bit defines the relation between the internal control signal and the output control signal.
 * |        |          |0 = No effect.
 * |        |          |1 = The control signal will be inverted before its output.
 * |        |          |Note: The control signal has different definitions in different protocol
 * |        |          |In SPI protocol, the control signal means slave select signal
 * |[11:8]  |DWIDTH    |Word Length of Transmission
 * |        |          |This bit field defines the data word length (amount of bits) for reception and transmission
 * |        |          |The data word is always right-aligned in the data buffer
 * |        |          |USCI support word length from 4 to 16 bits.
 * |        |          |0x0: The data word contains 16 bits located at bit positions [15:0].
 * |        |          |0x1: Reserved.
 * |        |          |0x2: Reserved.
 * |        |          |0x3: Reserved.
 * |        |          |0x4: The data word contains 4 bits located at bit positions [3:0].
 * |        |          |0x5: The data word contains 5 bits located at bit positions [4:0].
 * |        |          |...
 * |        |          |0xF: The data word contains 15 bits located at bit positions [14:0].
 * @var USPI_T::TXDAT
 * Offset: 0x30  USCI Transmit Data Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |TXDAT     |Transmit Data
 * |        |          |Software can use this bit field to write 16-bit transmit data for transmission
 * |        |          |In order to avoid overwriting the transmit data, user have to check TXEMPTY (USPI_BUFSTS[8]) status before writing transmit data into this bit field.
 * |[16]    |PORTDIR   |Port Direction Control
 * |        |          |This bit field is only available while USCI operates in SPI protocol (FUNMODE = 0x1) with half-duplex transfer
 * |        |          |It is used to define the direction of the data port pin
 * |        |          |When software writes USPI_TXDAT register, the transmit data and its port direction are settled simultaneously.
 * |        |          |0 = The data pin is configured as output mode.
 * |        |          |1 = The data pin is configured as input mode.
 * @var USPI_T::RXDAT
 * Offset: 0x34  USCI Receive Data Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |RXDAT     |Received Data
 * |        |          |This bit field monitors the received data which stored in receive data buffer.
 * @var USPI_T::BUFCTL
 * Offset: 0x38  USCI Transmit/Receive Buffer Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[6]     |TXUDRIEN  |Slave Transmit Under Run Interrupt Enable Bit
 * |        |          |0 = Transmit under-run interrupt Disabled.
 * |        |          |1 = Transmit under-run interrupt Enabled.
 * |[7]     |TXCLR     |Clear Transmit Buffer
 * |        |          |0 = No effect.
 * |        |          |1 = The transmit buffer is cleared
 * |        |          |Should only be used while the buffer is not taking part in data traffic.
 * |        |          |Note: It is cleared automatically after one PCLK cycle.
 * |[14]    |RXOVIEN   |Receive Buffer Overrun Interrupt Enable Bit
 * |        |          |0 = Receive overrun interrupt Disabled.
 * |        |          |1 = Receive overrun interrupt Enabled.
 * |[15]    |RXCLR     |Clear Receive Buffer
 * |        |          |0 = No effect.
 * |        |          |1 = The receive buffer is cleared
 * |        |          |Should only be used while the buffer is not taking part in data traffic.
 * |        |          |Note: It is cleared automatically after one PCLK cycle.
 * |[16]    |TXRST     |Transmit Reset
 * |        |          |0 = No effect.
 * |        |          |1 = Reset the transmit-related counters, state machine, and the content of transmit shift register and data buffer.
 * |        |          |Note 1: It is cleared automatically after one PCLK cycle.
 * |        |          |Note 2: Write 1 to this bit will set the output data pin to zero if USPI_PROTCTL[28]=0.
 * |[17]    |RXRST     |Receive Reset
 * |        |          |0 = No effect.
 * |        |          |1 = Reset the receive-related counters, state machine, and the content of receive shift register and data buffer.
 * |        |          |Note: It is cleared automatically after one PCLK cycle.
 * @var USPI_T::BUFSTS
 * Offset: 0x3C  USCI Transmit/Receive Buffer Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |RXEMPTY   |Receive Buffer Empty Indicator
 * |        |          |0 = Receive buffer is not empty.
 * |        |          |1 = Receive buffer is empty.
 * |[1]     |RXFULL    |Receive Buffer Full Indicator
 * |        |          |0 = Receive buffer is not full.
 * |        |          |1 = Receive buffer is full.
 * |[3]     |RXOVIF    |Receive Buffer Over-run Interrupt Status
 * |        |          |This bit indicates that a receive buffer overrun event has been detected
 * |        |          |If RXOVIEN (USPI_BUFCTL[14]) is enabled, the corresponding interrupt request is activated
 * |        |          |It is cleared by software writes 1 to this bit.
 * |        |          |0 = A receive buffer overrun event has not been detected.
 * |        |          |1 = A receive buffer overrun event has been detected.
 * |[8]     |TXEMPTY   |Transmit Buffer Empty Indicator
 * |        |          |0 = Transmit buffer is not empty.
 * |        |          |1 = Transmit buffer is empty and available for the next transmission datum.
 * |[9]     |TXFULL    |Transmit Buffer Full Indicator
 * |        |          |0 = Transmit buffer is not full.
 * |        |          |1 = Transmit buffer is full.
 * |[11]    |TXUDRIF   |Transmit Buffer Under-run Interrupt Status
 * |        |          |This bit indicates that a transmit buffer under-run event has been detected
 * |        |          |If enabled by TXUDRIEN (USPI_BUFCTL[6]), the corresponding interrupt request is activated
 * |        |          |It is cleared by software writes 1 to this bit
 * |        |          |0 = A transmit buffer under-run event has not been detected.
 * |        |          |1 = A transmit buffer under-run event has been detected.
 * @var USPI_T::PDMACTL
 * Offset: 0x40  USCI PDMA Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PDMARST   |PDMA Reset
 * |        |          |0 = No effect.
 * |        |          |1 = Reset the USCI's PDMA control logic. This bit will be cleared to 0 automatically.
 * |[1]     |TXPDMAEN  |PDMA Transmit Channel Available
 * |        |          |0 = Transmit PDMA function Disabled.
 * |        |          |1 = Transmit PDMA function Enabled.
 * |        |          |Note 1: In SPI Master mode with full duplex transfer, if both TX and RX PDMA functions are enabled, RX PDMA function cannot be enabled prior to TX PDMA function
 * |        |          |User can enable TX PDMA function firstly or enable both functions simultaneously.
 * |        |          |Note 2: In SPI Master mode with full duplex transfer, if both TX and RX PDMA functions are enabled, TX PDMA function cannot be disabled prior to RX PDMA function
 * |        |          |User can disable RX PDMA function firstly or disable both functions simultaneously.
 * |[2]     |RXPDMAEN  |PDMA Receive Channel Available
 * |        |          |0 = Receive PDMA function Disabled.
 * |        |          |1 = Receive PDMA function Enabled.
 * |[3]     |PDMAEN    |PDMA Mode Enable Bit
 * |        |          |0 = PDMA function Disabled.
 * |        |          |1 = PDMA function Enabled.
 * @var USPI_T::WKCTL
 * Offset: 0x54  USCI Wake-up Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |WKEN      |Wake-up Enable Bit
 * |        |          |0 = Wake-up function Disabled.
 * |        |          |1 = Wake-up function Enabled.
 * |[2]     |PDBOPT    |Power Down Blocking Option
 * |        |          |0 = If user attempts to enter Power-down mode by executing WFI while the protocol is in transferring, MCU will stop the transfer and enter Power-down mode immediately.
 * |        |          |1 = If user attempts to enter Power-down mode by executing WFI while the protocol is in transferring, the on-going transfer will not be stopped and MCU will enter idle mode immediately.
 * @var USPI_T::WKSTS
 * Offset: 0x58  USCI Wake-up Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |WKF       |Wake-up Flag
 * |        |          |When chip is woken up from Power-down mode, this bit is set to 1
 * |        |          |Software can write 1 to clear this bit.
 * @var USPI_T::PROTCTL
 * Offset: 0x5C  USCI Protocol Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SLAVE     |Slave Mode Selection
 * |        |          |0 = Master mode.
 * |        |          |1 = Slave mode.
 * |[1]     |SLV3WIRE  |Slave 3-wire Mode Selection -Slave Only
 * |        |          |The SPI protocol can work with 3-wire interface (without slave select signal) in Slave mode.
 * |        |          |0 = 4-wire bi-direction interface.
 * |        |          |1 = 3-wire bi-direction interface.
 * |[2]     |SS        |Slave Select Control -Master Only
 * |        |          |If AUTOSS bit is cleared, setting this bit to 1 will set the slave select signal to active state, and setting this bit to 0 will set the slave select back to inactive state.
 * |        |          |If the AUTOSS function is enabled (AUTOSS = 1), the setting value of this bit will not affect the current state of slave select signal.
 * |        |          |Note: In SPI protocol, the internal slave select signal is active high.
 * |[3]     |AUTOSS    |Automatic Slave Select Function Enable -Master Only
 * |        |          |0 = Slave select signal will be controlled by the setting value of SS (USPI_PROTCTL[2]) bit.
 * |        |          |1 = Slave select signal will be generated automatically
 * |        |          |The slave select signal will be asserted by the SPI controller when transmit/receive is started, and will be de-asserted after each transmit/receive is finished.
 * |[7:6]   |SCLKMODE  |Serial Bus Clock Mode
 * |        |          |This bit field defines the SCLK idle status, data transmit, and data receive edge.
 * |        |          |MODE0 = The idle state of SPI clock is low level
 * |        |          |Data is transmitted with falling edge and received with rising edge.
 * |        |          |MODE1 = The idle state of SPI clock is low level
 * |        |          |Data is transmitted with rising edge and received with falling edge.
 * |        |          |MODE2 = The idle state of SPI clock is high level
 * |        |          |Data is transmitted with rising edge and received with falling edge.
 * |        |          |MODE3 = The idle state of SPI clock is high level
 * |        |          |Data is transmitted with falling edge and received with rising edge.
 * |[11:8]  |SUSPITV   |Suspend Interval -Master Only
 * |        |          |This bit field provides the configurable suspend interval between two successive transmit/receive transaction in a transfer
 * |        |          |The definition of the suspend interval is the interval between the last clock edge of the preceding transaction word and the first clock edge of the following transaction word
 * |        |          |The default value is 0x3
 * |        |          |The period of the suspend interval is obtained according to the following equation.
 * |        |          |(SUSPITV[3:0] + 0.5) * period of SPI_CLK clock cycle
 * |        |          |Example:
 * |        |          |SUSPITV = 0x0 ... 0.5 SPI_CLK clock cycle.
 * |        |          |SUSPITV = 0x1 ... 1.5 SPI_CLK clock cycle.
 * |        |          |... ...
 * |        |          |SUSPITV = 0xE ... 14.5 SPI_CLK clock cycle.
 * |        |          |SUSPITV = 0xF ... 15.5 SPI_CLK clock cycle.
 * |[14:12] |TSMSEL    |Transmit Data Mode Selection
 * |        |          |This bit field describes how receive and transmit data is shifted in and out.
 * |        |          |TSMSEL = 000b: Full-duplex SPI.
 * |        |          |TSMSEL = 100b: Half-duplex SPI.
 * |        |          |Other values are reserved.
 * |        |          |Note: Changing the value of this bit field will produce the TXRST and RXRST to clear the TX/RX data buffer automatically.
 * |[25:16] |SLVTOCNT  |Slave Mode Time-out Period -Slave Only
 * |        |          |In Slave mode, this bit field is used for Slave time-out period
 * |        |          |This bit field indicates how many clock periods (selected by TMCNTSRC, USPI_BRGEN[5]) between the two edges of input SCLK will assert the Slave time-out event
 * |        |          |Writing 0x0 into this bit field will disable the Slave time-out function.
 * |        |          |Example: Assume SLVTOCNT is 0x0A and TMCNTSRC (USPI_BRGEN[5]) is 1, it means the time-out event will occur if the state of SPI bus clock pin is not changed more than (10+1) periods of fDIV_CLK.
