wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/uspi_reg.h
 * |[28]    |TXUDRPOL  |Transmit Under-run Data Polarity -for Slave
 * |        |          |This bit defines the transmitting data value of USCIx_DAT1 when no data is available for transferring.
 * |        |          |0 = The output data value is 0 if TX under run event occurs.
 * |        |          |1 = The output data value is 1 if TX under run event occurs.
 * |[31]    |PROTEN    |SPI Protocol Enable Bit
 * |        |          |0 = SPI Protocol Disabled.
 * |        |          |1 = SPI Protocol Enabled.
 * @var USPI_T::PROTIEN
 * Offset: 0x60  USCI Protocol Interrupt Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SSINAIEN  |Slave Select Inactive Interrupt Enable Bit
 * |        |          |This bit enables/disables the generation of a slave select interrupt if the slave select changes to inactive.
 * |        |          |0 = Slave select inactive interrupt generation Disabled.
 * |        |          |1 = Slave select inactive interrupt generation Enabled.
 * |[1]     |SSACTIEN  |Slave Select Active Interrupt Enable Bit
 * |        |          |This bit enables/disables the generation of a slave select interrupt if the slave select changes to active.
 * |        |          |0 = Slave select active interrupt generation Disabled.
 * |        |          |1 = Slave select active interrupt generation Enabled.
 * |[2]     |SLVTOIEN  |Slave Time-out Interrupt Enable Bit
 * |        |          |In SPI protocol, this bit enables the interrupt generation in case of a Slave time-out event.
 * |        |          |0 = The Slave time-out interrupt Disabled.
 * |        |          |1 = The Slave time-out interrupt Enabled.
 * |[3]     |SLVBEIEN  |Slave Mode Bit Count Error Interrupt Enable Bit
 * |        |          |If data transfer is terminated by slave time-out or slave select inactive event in Slave mode, so that the transmit/receive data bit count does not match the setting of DWIDTH (USPI_LINECTL[11:8])
 * |        |          |Bit count error event occurs.
 * |        |          |0 = The Slave mode bit count error interrupt Disabled.
 * |        |          |1 = The Slave mode bit count error interrupt Enabled.
 * @var USPI_T::PROTSTS
 * Offset: 0x64  USCI Protocol Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1]     |TXSTIF    |Transmit Start Interrupt Flag
 * |        |          |0 = Transmit start event did not occur.
 * |        |          |1 = Transmit start event occurred.
 * |        |          |Note: It is cleared by software write 1 to this bit
 * |        |          |The transmit start event happens when hardware starts to move TX data from data buffer to shift data unit.
 * |[2]     |TXENDIF   |Transmit End Interrupt Flag
 * |        |          |0 = Transmit end event did not occur.
 * |        |          |1 = Transmit end event occurred.
 * |        |          |Note: It is cleared by software write 1 to this bit
 * |        |          |The transmit end event happens when hardware sends the last bit of TX data from shift data unit.
 * |[3]     |RXSTIF    |Receive Start Interrupt Flag
 * |        |          |0 = Receive start event did not occur.
 * |        |          |1 = Receive start event occurred.
 * |        |          |Note: It is cleared by software write 1 to this bit
 * |        |          |For SPI master mode, the receive start event happens when SPI master sends slave select active and spi clock to the external SPI slave
 * |        |          |For SPI slave mode, the receive start event happens when slave select of SPI slave is active and spi clock of SPI slave is inputed from the external SPI master.
 * |[4]     |RXENDIF   |Receive End Interrupt Flag
 * |        |          |0 = Receive end event did not occur.
 * |        |          |1 = Receive end event occurred.
 * |        |          |Note: It is cleared by software write 1 to this bit
 * |        |          |The receive end event happens when hardware receives the last bit of RX data into shift data unit.
 * |[5]     |SLVTOIF   |Slave Time-out Interrupt Flag -for Slave Only
 * |        |          |0 = Slave time-out event did not occur.
 * |        |          |1 = Slave time-out event occurred.
 * |        |          |Note: It is cleared by software write 1 to this bit
 * |[6]     |SLVBEIF   |Slave Bit Count Error Interrupt Flag -for Slave Only
 * |        |          |0 = Slave bit count error event did not occur.
 * |        |          |1 = Slave bit count error event occurred.
 * |        |          |Note: It is cleared by software write 1 to this bit
 * |        |          |If the transmit/receive data bit count does not match the setting of DWIDTH (USPI_LINECTL[11:8]), bit count error event occurs.
 * |[8]     |SSINAIF   |Slave Select Inactive Interrupt Flag -for Slave Only
 * |        |          |This bit indicates that the internal slave select signal has changed to inactive
 * |        |          |It is cleared by software writes 1 to this bit
 * |        |          |0 = The slave select signal has not changed to inactive.
 * |        |          |1 = The slave select signal has changed to inactive.
 * |        |          |Note: The internal slave select signal is active high.
 * |[9]     |SSACTIF   |Slave Select Active Interrupt Flag -for Slave Only
 * |        |          |This bit indicates that the internal slave select signal has changed to active
 * |        |          |It is cleared by software writes one to this bit
 * |        |          |0 = The slave select signal has not changed to active.
 * |        |          |1 = The slave select signal has changed to active.
 * |        |          |Note: The internal slave select signal is active high.
 * |[16]    |SSLINE    |Slave Select Line Bus Status (Read Only)
 * |        |          |This bit is only available in Slave mode
 * |        |          |It used to monitor the current status of the input slave select signal on the bus.
 * |        |          |0 = The slave select line status is 0.
 * |        |          |1 = The slave select line status is 1.
 * |[17]    |BUSY      |Busy Status (Read Only)
 * |        |          |0 = SPI is in idle state.
 * |        |          |1 = SPI is in busy state.
 * |        |          |The following listing are the bus busy conditions:
 * |        |          |a. USPI_PROTCTL[31] = 1 and the TXEMPTY = 0.
 * |        |          |b. For SPI Master mode, the TXEMPTY = 1 but the current transaction is not finished yet.
 * |        |          |c. For SPI Slave mode, the USPI_PROTCTL[31] = 1 and there is serial clock input into the SPI core logic when slave select is active.
 * |        |          |d. For SPI Slave mode, the USPI_PROTCTL[31] = 1 and the transmit buffer or transmit shift register is not empty even if the slave select is inactive.
 * |[18]    |SLVUDR    |Slave Mode Transmit Under-run Status (Read Only)
 * |        |          |In Slave mode, if there is no available transmit data in buffer while transmit data shift out caused by input serial bus clock, this status flag will be set to 1
 * |        |          |This bit indicates whether the current shift-out data of word transmission is switched to TXUDRPOL (USPI_PROTCTL[28]) or not.
 * |        |          |0 = Slave transmit under run event does not occur.
 * |        |          |1 = Slave transmit under run event occurs.
 */
    __IO uint32_t CTL;                   /*!< [0x0000] USCI Control Register                                            */
    __IO uint32_t INTEN;                 /*!< [0x0004] USCI Interrupt Enable Register                                   */
    __IO uint32_t BRGEN;                 /*!< [0x0008] USCI Baud Rate Generator Register                                */
    __I  uint32_t RESERVE0[1];
    __IO uint32_t DATIN0;                /*!< [0x0010] USCI Input Data Signal Configuration Register 0                  */
    __I  uint32_t RESERVE1[3];
    __IO uint32_t CTLIN0;                /*!< [0x0020] USCI Input Control Signal Configuration Register 0               */
    __I  uint32_t RESERVE2[1];
    __IO uint32_t CLKIN;                 /*!< [0x0028] USCI Input Clock Signal Configuration Register                   */
    __IO uint32_t LINECTL;               /*!< [0x002c] USCI Line Control Register                                       */
    __O  uint32_t TXDAT;                 /*!< [0x0030] USCI Transmit Data Register                                      */
    __I  uint32_t RXDAT;                 /*!< [0x0034] USCI Receive Data Register                                       */
    __IO uint32_t BUFCTL;                /*!< [0x0038] USCI Transmit/Receive Buffer Control Register                    */
    __IO uint32_t BUFSTS;                /*!< [0x003c] USCI Transmit/Receive Buffer Status Register                     */
    __IO uint32_t PDMACTL;               /*!< [0x0040] USCI PDMA Control Register                                       */
    __I  uint32_t RESERVE3[4];
    __IO uint32_t WKCTL;                 /*!< [0x0054] USCI Wake-up Control Register                                    */
    __IO uint32_t WKSTS;                 /*!< [0x0058] USCI Wake-up Status Register                                     */
    __IO uint32_t PROTCTL;               /*!< [0x005c] USCI Protocol Control Register                                   */
    __IO uint32_t PROTIEN;               /*!< [0x0060] USCI Protocol Interrupt Enable Register                          */
    __IO uint32_t PROTSTS;               /*!< [0x0064] USCI Protocol Status Register                                    */

} USPI_T;

/**
    @addtogroup USPI_CONST USPI Bit Field Definition
    Constant Definitions for USPI Controller
@{ */

#define USPI_CTL_FUNMODE_Pos          (0)                                            /*!< USPI_T::CTL: FUNMODE Position       */
#define USPI_CTL_FUNMODE_Msk          (0x7ul << USPI_CTL_FUNMODE_Pos)                /*!< USPI_T::CTL: FUNMODE Mask           */

