wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/uspi_reg.h
#define USPI_INTEN_TXSTIEN_Pos        (1)                                            /*!< USPI_T::INTEN: TXSTIEN Position     */
#define USPI_INTEN_TXSTIEN_Msk        (0x1ul << USPI_INTEN_TXSTIEN_Pos)              /*!< USPI_T::INTEN: TXSTIEN Mask         */

#define USPI_INTEN_TXENDIEN_Pos       (2)                                            /*!< USPI_T::INTEN: TXENDIEN Position    */
#define USPI_INTEN_TXENDIEN_Msk       (0x1ul << USPI_INTEN_TXENDIEN_Pos)             /*!< USPI_T::INTEN: TXENDIEN Mask        */

#define USPI_INTEN_RXSTIEN_Pos        (3)                                            /*!< USPI_T::INTEN: RXSTIEN Position     */
#define USPI_INTEN_RXSTIEN_Msk        (0x1ul << USPI_INTEN_RXSTIEN_Pos)              /*!< USPI_T::INTEN: RXSTIEN Mask         */

#define USPI_INTEN_RXENDIEN_Pos       (4)                                            /*!< USPI_T::INTEN: RXENDIEN Position    */
#define USPI_INTEN_RXENDIEN_Msk       (0x1ul << USPI_INTEN_RXENDIEN_Pos)             /*!< USPI_T::INTEN: RXENDIEN Mask        */

#define USPI_BRGEN_RCLKSEL_Pos        (0)                                            /*!< USPI_T::BRGEN: RCLKSEL Position     */
#define USPI_BRGEN_RCLKSEL_Msk        (0x1ul << USPI_BRGEN_RCLKSEL_Pos)              /*!< USPI_T::BRGEN: RCLKSEL Mask         */

#define USPI_BRGEN_PTCLKSEL_Pos       (1)                                            /*!< USPI_T::BRGEN: PTCLKSEL Position    */
#define USPI_BRGEN_PTCLKSEL_Msk       (0x1ul << USPI_BRGEN_PTCLKSEL_Pos)             /*!< USPI_T::BRGEN: PTCLKSEL Mask        */

#define USPI_BRGEN_SPCLKSEL_Pos       (2)                                            /*!< USPI_T::BRGEN: SPCLKSEL Position    */
#define USPI_BRGEN_SPCLKSEL_Msk       (0x3ul << USPI_BRGEN_SPCLKSEL_Pos)             /*!< USPI_T::BRGEN: SPCLKSEL Mask        */

#define USPI_BRGEN_TMCNTEN_Pos        (4)                                            /*!< USPI_T::BRGEN: TMCNTEN Position     */
#define USPI_BRGEN_TMCNTEN_Msk        (0x1ul << USPI_BRGEN_TMCNTEN_Pos)              /*!< USPI_T::BRGEN: TMCNTEN Mask         */

#define USPI_BRGEN_TMCNTSRC_Pos       (5)                                            /*!< USPI_T::BRGEN: TMCNTSRC Position    */
#define USPI_BRGEN_TMCNTSRC_Msk       (0x1ul << USPI_BRGEN_TMCNTSRC_Pos)             /*!< USPI_T::BRGEN: TMCNTSRC Mask        */

#define USPI_BRGEN_CLKDIV_Pos         (16)                                           /*!< USPI_T::BRGEN: CLKDIV Position      */
#define USPI_BRGEN_CLKDIV_Msk         (0x3fful << USPI_BRGEN_CLKDIV_Pos)             /*!< USPI_T::BRGEN: CLKDIV Mask          */

#define USPI_DATIN0_SYNCSEL_Pos       (0)                                            /*!< USPI_T::DATIN0: SYNCSEL Position    */
#define USPI_DATIN0_SYNCSEL_Msk       (0x1ul << USPI_DATIN0_SYNCSEL_Pos)             /*!< USPI_T::DATIN0: SYNCSEL Mask        */

#define USPI_DATIN0_ININV_Pos         (2)                                            /*!< USPI_T::DATIN0: ININV Position      */
#define USPI_DATIN0_ININV_Msk         (0x1ul << USPI_DATIN0_ININV_Pos)               /*!< USPI_T::DATIN0: ININV Mask          */

#define USPI_CTLIN0_SYNCSEL_Pos       (0)                                            /*!< USPI_T::CTLIN0: SYNCSEL Position    */
#define USPI_CTLIN0_SYNCSEL_Msk       (0x1ul << USPI_CTLIN0_SYNCSEL_Pos)             /*!< USPI_T::CTLIN0: SYNCSEL Mask        */

#define USPI_CTLIN0_ININV_Pos         (2)                                            /*!< USPI_T::CTLIN0: ININV Position      */
#define USPI_CTLIN0_ININV_Msk         (0x1ul << USPI_CTLIN0_ININV_Pos)               /*!< USPI_T::CTLIN0: ININV Mask          */

#define USPI_CLKIN_SYNCSEL_Pos        (0)                                            /*!< USPI_T::CLKIN: SYNCSEL Position     */
#define USPI_CLKIN_SYNCSEL_Msk        (0x1ul << USPI_CLKIN_SYNCSEL_Pos)              /*!< USPI_T::CLKIN: SYNCSEL Mask         */

#define USPI_LINECTL_LSB_Pos          (0)                                            /*!< USPI_T::LINECTL: LSB Position       */
#define USPI_LINECTL_LSB_Msk          (0x1ul << USPI_LINECTL_LSB_Pos)                /*!< USPI_T::LINECTL: LSB Mask           */

#define USPI_LINECTL_DATOINV_Pos      (5)                                            /*!< USPI_T::LINECTL: DATOINV Position   */
#define USPI_LINECTL_DATOINV_Msk      (0x1ul << USPI_LINECTL_DATOINV_Pos)            /*!< USPI_T::LINECTL: DATOINV Mask       */

#define USPI_LINECTL_CTLOINV_Pos      (7)                                            /*!< USPI_T::LINECTL: CTLOINV Position   */
#define USPI_LINECTL_CTLOINV_Msk      (0x1ul << USPI_LINECTL_CTLOINV_Pos)            /*!< USPI_T::LINECTL: CTLOINV Mask       */

#define USPI_LINECTL_DWIDTH_Pos       (8)                                            /*!< USPI_T::LINECTL: DWIDTH Position    */
#define USPI_LINECTL_DWIDTH_Msk       (0xful << USPI_LINECTL_DWIDTH_Pos)             /*!< USPI_T::LINECTL: DWIDTH Mask        */

#define USPI_TXDAT_TXDAT_Pos          (0)                                            /*!< USPI_T::TXDAT: TXDAT Position       */
#define USPI_TXDAT_TXDAT_Msk          (0xfffful << USPI_TXDAT_TXDAT_Pos)             /*!< USPI_T::TXDAT: TXDAT Mask           */

#define USPI_TXDAT_PORTDIR_Pos        (16)                                           /*!< USPI_T::TXDAT: PORTDIR Position     */
#define USPI_TXDAT_PORTDIR_Msk        (0x1ul << USPI_TXDAT_PORTDIR_Pos)              /*!< USPI_T::TXDAT: PORTDIR Mask         */

#define USPI_RXDAT_RXDAT_Pos          (0)                                            /*!< USPI_T::RXDAT: RXDAT Position       */
#define USPI_RXDAT_RXDAT_Msk          (0xfffful << USPI_RXDAT_RXDAT_Pos)             /*!< USPI_T::RXDAT: RXDAT Mask           */

#define USPI_BUFCTL_TXUDRIEN_Pos      (6)                                            /*!< USPI_T::BUFCTL: TXUDRIEN Position   */
#define USPI_BUFCTL_TXUDRIEN_Msk      (0x1ul << USPI_BUFCTL_TXUDRIEN_Pos)            /*!< USPI_T::BUFCTL: TXUDRIEN Mask       */

#define USPI_BUFCTL_TXCLR_Pos         (7)                                            /*!< USPI_T::BUFCTL: TXCLR Position      */
#define USPI_BUFCTL_TXCLR_Msk         (0x1ul << USPI_BUFCTL_TXCLR_Pos)               /*!< USPI_T::BUFCTL: TXCLR Mask          */

#define USPI_BUFCTL_RXOVIEN_Pos       (14)                                           /*!< USPI_T::BUFCTL: RXOVIEN Position    */
#define USPI_BUFCTL_RXOVIEN_Msk       (0x1ul << USPI_BUFCTL_RXOVIEN_Pos)             /*!< USPI_T::BUFCTL: RXOVIEN Mask        */

#define USPI_BUFCTL_RXCLR_Pos         (15)                                           /*!< USPI_T::BUFCTL: RXCLR Position      */
#define USPI_BUFCTL_RXCLR_Msk         (0x1ul << USPI_BUFCTL_RXCLR_Pos)               /*!< USPI_T::BUFCTL: RXCLR Mask          */

#define USPI_BUFCTL_TXRST_Pos         (16)                                           /*!< USPI_T::BUFCTL: TXRST Position      */
#define USPI_BUFCTL_TXRST_Msk         (0x1ul << USPI_BUFCTL_TXRST_Pos)               /*!< USPI_T::BUFCTL: TXRST Mask          */

